---
kind: method
id: M:Autodesk.Revit.DB.Electrical.GroundConductorSizeSet.GetEnumerator
source: html/77a31304-1310-12a8-17d4-5fdd817fe270.htm
---
# Autodesk.Revit.DB.Electrical.GroundConductorSizeSet.GetEnumerator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the set.